messages = {
    "pls_wait": "Пожалуйста, подождите...",
    "register_ref_error": "Регистрация в боте возможна только по реферальной ссылке",
    "ref_link_error": "Недействительная реферальная ссылка",
    "connect_wallet_time": "Подключите кошелек в течение 5 минут",
    "connect_wallet_error": "Ошибка подключения кошелька",
    "wallet_connected": "Ваш кошелек уже подключен",
    "wallet_disconnected": "Кошелек отключен",
    "subscribe_on_channel": 'Прежде чем начать работу с ботом подпишитесь на <a href="t.me/tsc_official_channel">канал</a>',
    "subscription_error": "Вы не подписаны на канал",
    "push_personal_account": "Нажмите кнопку «личный кабинет»",
    "something_went_wrong": "Что-то пошло не так\nПопробуйте еще раз позже",
    "accept_trans": "Подтвердите транзакцию в кошельке для дальнейшей работы с ботом",
    "main_menu": 'Личный кабинет👤\n\n'
                 'Рефералы первого уровня: {}\n'
                 'Все рефералы: {}\n'
                 'Вас пригласил: {}\n'
                 'Квалификация: {}\n'
                 'Баланс STS: {}\n'
                 'Баланс STS в стейкинге: {}\n'
                 'Получено TS за стейкинг: {}\n'
                 'В стейке у рефералов: {}\n'
                 'Баланс TS: {}\n'
                 'Реферальная ссылка: {}\n\n'
                 'Данные актуальны на: {} (UTC)',
    "buy_ts_amount": 'Введите количество TS для покупки:\n'
                     'Курс: 1 TON = 4 TS\n\n'
                     '5 TON = 20 TS'
                     '10 TON = 40 TS'
                     '50 TON = 200 TS'
                     '100 TON = 400 TS',
    "buy_ts_amount_error": "Неверное количество TS, попробуйте еще раз",
    "buy_ts_approve": 'Вы уверены, что хотите купить {} TS за TON?',
    "sell_ts_amount": 'Введите сколько TS перевести в STS.\n'
                      'Ваш баланс {} TS',
    "sell_ts_amount_error": 'Неверное количество TS, попробуйте еще раз\n'
                            'Ваш баланс {} TS',
    "sell_ts_approve": 'Вы уверены, что хотите перевести {} TS в STS?',
    "stake_sts_not_enough": 'Недостаточно STS. Минимум 20 STS\n'
                            'Ваш баланс {} STS',
    "stake_sts_amount": 'Введите количество STS для стейкинга. (Минимум 20)\n'
                        'Ваш баланс {} STS',
    "stake_sts_amount_error": 'Неверное количество STS (Минимум 20), попробуйте еще раз\n'
                              'Ваш баланс {} STS',
    "stake_sts_approve": 'Вы уверены, что хотите застейкать {} STS?', 
    "unstake_sts_amount": 'Введите количество STS для вывода из стейкинга.\n'
                          '(в стейке должно остаться не меньше 20 или 0)\n'
                          'Ваш баланс {} STS в стейке',
    "unstake_sts_amount_error": 'Неверное количество STS, попробуйте еще раз\n'
                                '(в стейке должно остаться не меньше 20 или 0)\n'
                                'Ваш баланс {} STS в стейке',
}

buttons = {
    "open_wallet": "Открыть кошелек",
    "check_subs": "Проверить подписку",
    "buy_ts": "📥 Купить TS за TON",
    "sell_ts": "💱 Обмен TS на STS",
    "stake_sts": "Депозит STS в стейкинг",
    "unstake_sts": "Вывод STS из стейкинга",
    "refresh": "🔄 Обновить",
    "back": "◀️ Назад",
    "yes": "✅ Да",
    "no": "❌ Нет"
}
